In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [9]:
# Series...

# Create two series
series1 = Series(np.linspace(0,9,3), index=['a','b','c'])
series2 = Series(np.linspace(10,20,4), index=['a','b','c','d'])

In [12]:
series1

a    0.0
b    4.5
c    9.0
dtype: float64

In [13]:
series2

a    10.000000
b    13.333333
c    16.666667
d    20.000000
dtype: float64

In [15]:
# Add two series - elementwise, NaN added if different cardinalities
series1 + series2

a    10.000000
b    17.833333
c    25.666667
d          NaN
dtype: float64

In [32]:
# Data Frames...

#Create two data frames
df1 = DataFrame(np.linspace(0,10,9).reshape((3,3)), 
                index=['Rice', 'Stanford', "MIT"], columns=['City', 'Enrollment', 'Tuition'])

df2 = DataFrame(np.linspace(10,20,9).reshape((3,3)), 
                index=['Rice', 'Stanford', 'UChicago'], columns=['City', 'Enrollment', 'Rating'])

In [33]:
df1

          City  Enrollment  Tuition
Rice      0.00        1.25     2.50
Stanford  3.75        5.00     6.25
MIT       7.50        8.75    10.00

In [34]:
df2

           City  Enrollment  Rating
Rice      10.00       11.25   12.50
Stanford  13.75       15.00   16.25
UChicago  17.50       18.75   20.00

In [36]:
# Adds elemenents between DF's for which row and column identifiers match
df1 + df2

          City  Enrollment  Rating  Tuition
MIT        NaN         NaN     NaN      NaN
Rice      10.0        12.5     NaN      NaN
Stanford  17.5        20.0     NaN      NaN
UChicago   NaN         NaN     NaN      NaN

In [38]:
# Repeat but with fill value instead of NaN
df1.add(df2,fill_value=0)

          City  Enrollment  Rating  Tuition
MIT        7.5        8.75     NaN    10.00
Rice      10.0       12.50   12.50     2.50
Stanford  17.5       20.00   16.25     6.25
UChicago  17.5       18.75   20.00      NaN

In [43]:
# Operations between DF and Series

row0 = df1.iloc[0] # gets 0th row from df
row0

City          0.00
Enrollment    1.25
Tuition       2.50
Name: Rice, dtype: float64

In [44]:
df1 - row0

          City  Enrollment  Tuition
Rice      0.00        0.00     0.00
Stanford  3.75        3.75     3.75
MIT       7.50        7.50     7.50